Lucho431/Robotica/robot_core_STM32F429IGT6/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "dac.h"
#include "i2c.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "comandosUart.h"
#include "comunicacionUART.h"
#include "mpu_9265_lfs.h"
#include "stdlib.h"
#include "math.h"
#include "stdio.h"
#include "stm32f4xx_ll_usart.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef enum{
	QUIETO,
	AVANZANDO,
	RETROCEDIENDO,
	ROTANDO_IZQ,
	ROTANDO_DER,
	PIVOTE_IZQ_AVAN,
	PIVOTE_DER_AVAN,
	PIVOTE_IZQ_RETR,
	PIVOTE_DER_RETR,
}T_MOV;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define DIAMETRO_RUEDAS 	65  //en mm
#define RANURAS_ENCODER		20  //vuelta completa
#define AVANCE_X_PULSO		10  //en mm
#define AVANCE_X_PULSO_F	10.21 //float en mm
#define DIAMETRO_ACRILICO	130 //en mm
#define ANCHO_TOTAL			156 //156,6 mm
#define DISTANCIA_RUEDAS	125.0 //float en mm
#define RADIANES_X_PULSO	0.081681408993334 //float en radianes
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define TRIG_SR04 ( __HAL_TIM_SET_COUNTER(&htim5, 0xFFFFFFF5) )
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

//variables de calibracion del magnetometro//
volatile uint8_t estatus_calibraMag = 0;
volatile uint16_t periodo_calibraMag = 0xFFFF;

//variables de mov_puntoAPunto//
volatile uint8_t estatusPuntoAPunto = 0;
volatile uint16_t ticks_PuntoAPunto = 0xFFFF;
uint8_t flag_dest = 0; //indica si hay un destino establecido.
float anguloDest_rad_f32; //angulo a la coordenanda de destino desde la posicion actual.
float anguloDest_grad_f32;
int32_t anguloDest_grad_i32;
int32_t deltaAng_dest;
float deltaX_dest;
float deltaY_dest;

//comunicacion//
uint8_t rxUart[MAX_RX];
uint8_t size_rxUart;
uint8_t flag_cmd = 0;
uint8_t txUart[MAX_TX];
uint8_t flag_esp01Presente = 0;

//modo de funcionamiento//
T_MODO modoFuncionamiento= MANUAL;

//prueba//
uint8_t read_button = 1;
uint8_t last_button = 1;
uint32_t last_cuentaTIM7=0;
uint32_t duracionWhile1 = 0; // en 10 * ns
uint8_t flag_quieto = 0;

//movimiento//
T_MOV status_movimiento = QUIETO;
T_MOV last_movimiento = QUIETO;
int16_t distL; //distancia relativa de la rueda izquierda en ranuras cada 210 ms.
int16_t distR; //distancia relativa de la rueda derecha en ranuras cada 210 ms.
int16_t distC = 0; //distancia relativa del centro en ranuras cada 210 ms.


//mpu9265//
uint8_t flag_IMUPresente = 0;
uint8_t flag_muestreoIMU = 0;
mpuData_t mpu9265;
int32_t sum_magX, sum_magY; //para promediar
float magX, magY;
float magX_min = 1000, magX_max = -1000;
float magY_min = 1000, magY_max = -1000;
float magX_media = 0, magY_media = 0;
float magX_range = 1, magY_range = 1;
float direccionMag_rad_f32;
float direccionMag_grad_f32;
int16_t direccionMag_grad_i16;

float gyroZ, modGyroZ;
float direccionGiro_rad_f32;
float direccionGiro_grad_f32;
int16_t direccionGiro_grad_i16;

//filtro complementario//
float coef_gyro = 0.0; //0.98;
float coef_mag = 1.0; //0.02;
float alfa_filtroCompl = 0.1;

//filtro IIR//
//beta = 1 - exp(-Ts/tau) ; Ts = 210 ms
//float betaIIR = 0.508; // con tau = 0.3
//float betaIIR = 0.426; // con tau = 0.4
//float betaIIR = 0.343; // con tau = 0.5
//float betaIIR = 0.295; // con tau = 0.6
//float betaIIR = 0.259; // con tau = 0.7
//float betaIIR = 0.232; // con tau = 0.8
//float betaIIR = 0.210; // con tau = 0.9
float betaIIR = 0.189; // con tau = 1.0
uint8_t flag_iniciaIIR = 1;
float raw_magX;
float raw_magY;
float magX_iirX0;
float magX_iirY1;
float magY_iirX0;
float magY_iirY1;

float direccion_f32;
float last_direccion_f32;
float direccion_rad;
float direccion_grad;
int16_t direccion_i16;
int16_t direccion_home = 0;
int16_t direccion_dest;

//desplazamientos manuales//
uint16_t avance_cant = 0;
uint16_t retroceso_cant = 0;
uint16_t giroIzq_cant = 0;
uint16_t giroDer_cant = 0;

//coordenadas//
uint8_t pos_x;
uint8_t pos_y;
uint8_t pos_ang;
float posX_f32 = 0;
float posY_f32 = 0;
int16_t posX_i16;
int16_t posY_i16;
int16_t posX_home = 0;
int16_t posY_home = 0;
int16_t posX_dest;
int16_t posY_dest;

//sensores//
uint8_t SI, SF, SD;
uint8_t sensores_dist = 0;

//ticks//
uint8_t desbordeTIM7 = 0; //desborda cada 10 ms.
uint8_t periodo_muestrasOdometria = 7;
uint8_t periodo_SR04 = 0;
uint8_t periodo_pos = 7; //offset para operar en simultaneo con el periodo encoder
uint8_t flag_checkUart = 0;

//SR-04//
uint32_t ic1 = 0;
uint32_t ic2 = 0;
uint8_t flancoEco_SR04 = 0; //cuando cuenta 2, detectó ambos flancos. Valores mayores, son errores.
int32_t cuentaPulsos = 0;
uint16_t distanciaSR04 = 0; //distancia en cm.

//encoders//
int16_t encoderL;
int16_t encoderR;
int16_t encoderL_delta;
int16_t encoderR_delta;
int16_t acum_encoderL = 0;
int16_t acum_encoderR = 0;
int16_t encoderL_memPositivo = 0;
int16_t encoderR_memPositivo = 0;
int16_t encoderL_memNegativo = 0;
int16_t encoderR_memNegativo = 0;

