Lucho431/Robotica/robot_core_STM32F429IGT6/Core/Src/main.c
//velocidades//
int8_t velL = 0; //5; //en ranuras cada 210 ms
int8_t velR = 0; //5; //en ranuras cada 210 ms
uint8_t velLFinal = 5; //en ranuras cada 210 ms
uint8_t velRFinal = 5; //en ranuras cada 210 ms

//muestreo//
uint8_t flag_nuevasMuestras = 0;




/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
void sensores (void);
void movimientoLibre (void);
void movimientoRC (void);
void calibraMag (void);
void mov_puntoAPunto (void);
void modo_funcionamiento (void);
void velocidades (int8_t, int8_t);
void encoders_PWM (void);
void lecturaMPU9265 (void);
void posicionamiento (void);
void aceleracion (void);

void init_sensorDistancia(void);
void init_IMU(void);
void init_encoders(void);
void init_controlMotores(void);
void init_timersNecesarios(void);
void init_comESP01(void);

//punteros a funcion:
void (*lecturaIMU) (void) = mpu9265_dummy;


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DAC_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_TIM5_Init();
  MX_UART7_Init();
  MX_TIM7_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */

//  flag_quieto = 1; //comentar para que se mueva el robot

  HAL_TIM_Base_Start_IT(&htim7); //desborda cada 10 ms.

  HAL_TIM_Base_Start(&htim2); //encoder R.
  HAL_TIM_Base_Start(&htim3); //encoder L.

  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1); //rueda izquierda.
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_2); //rueda derecha.

  HAL_TIM_Base_Start(&htim5); //control del SR-04.
  HAL_TIM_PWM_Start(&htim5, TIM_CHANNEL_1); //para el pulso del trigger.
  HAL_TIM_IC_Start_IT(&htim5, TIM_CHANNEL_3); //para capturar el eco (flanco ascendente).
  HAL_TIM_IC_Start_IT(&htim5, TIM_CHANNEL_4); //para capturar el eco (flanco descendente).

  HAL_Delay(200); //espera previa para garantizar el correcto encendido del MPU9265
  if ( !mpu9265_Init(&hi2c1) ){
	  flag_IMUPresente = 1;
	  lecturaIMU = lecturaMPU9265;
  }

  init_controlRxTx (&huart7);
  HAL_Delay(200); //mas de 1ms para omitir la basura del arranque del ESP01
  LL_USART_EnableIT_IDLE(UART7);
  HAL_UART_Receive_IT(&huart7, rxUart, MAX_RX);



  if (!flag_esp01Presente) {
	  modoFuncionamiento = AUTOMATICO;
  }else{
	  modoFuncionamiento = MANUAL;
  }
  if (flag_IMUPresente != 0) modoFuncionamiento = CALIBRA_MAG;
//  modoFuncionamiento = MANUAL;

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  modo_funcionamiento();
	  sensores(); //SR04 e infrarrojos
	  velocidades(velL, velR);


	  if (desbordeTIM7 != 0){ //cada 10 ms

		  periodo_muestrasOdometria += desbordeTIM7;
		  periodo_SR04 += desbordeTIM7;
		  periodo_pos += desbordeTIM7;
		  desbordeTIM7 = 0;

		  if (periodo_muestrasOdometria > 21){ // en 10 * ms
			  lecturaIMU();
			  encoders_PWM();
			  flag_nuevasMuestras = 1;
			  periodo_muestrasOdometria = 0;
		  }

		  if (periodo_pos > 21){
			  if (flag_IMUPresente != 0) posicionamiento();
			  periodo_pos = 0;
		  }
		  if (periodo_SR04 > 21){
			  TRIG_SR04;
			  periodo_SR04 = 0;
		  }

		  //para la funcion orientando (comentar cuando no se requiera):
		  if (periodo_calibraMag != 0) periodo_calibraMag--;
		  if (ticks_PuntoAPunto != 0) ticks_PuntoAPunto--;

		  //valida que la uart no tenga el buffer a medio llenar (trama desfasada)
//		  if (huart7.RxXferCount != 8){
//			  if (!flag_checkUart){
//				  flag_checkUart = 1;
//			  }else{
//				  HAL_UART_AbortReceive_IT(&huart7);
//				  flag_cmd = 0;
//				  HAL_UART_Receive_IT(&huart7, rxUart, 8);
//			  }
//		  }else{
//			  flag_checkUart = 0;
//		  } //end if huart7.RxXferCount

	  } //fin if desbordeTIM7

	  //comunicacion ESP01
	  if (flag_cmd != 0){
//		  controlRxTxUART(rxUart);
		  procesaCmd(rxUart, size_rxUart);
		  flag_cmd = 0;
	  }

	  //cuenta duracion del bucle
	  duracionWhile1 = TIM7->CNT - last_cuentaTIM7;
	  last_cuentaTIM7 = TIM7->CNT;

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 180;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Activate the Over-Drive mode
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){
	if (htim->Instance==TIM7){
		desbordeTIM7++;
	}
}

