Lucho431/Robotica/robot_core_STM32F429IGT6/Core/Src/main.c
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim){
	if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_3){
		ic1 = htim->Instance->CCR3;
		flancoEco_SR04++;
	}

	if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4){
		ic2 = htim->Instance->CCR4;
		flancoEco_SR04++;
	}
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart){
	if (LL_USART_IsActiveFlag_IDLE(UART7)){
		uint8_t dummyRead = UART7->DR; //para deshabilitar el flag IDLE
		(void) dummyRead;
		size_rxUart = MAX_RX - huart7.RxXferCount;
		HAL_UART_AbortReceive_IT(&huart7);
		flag_cmd = 1;
	} //end if IDLE

} //end HAL_UART_RxCpltCallback ()


void sensores (void){

	switch (flancoEco_SR04){
		case 0:
		case 1:
			return;
		case 2:
			cuentaPulsos = (int32_t)(ic2 - ic1);
			if (cuentaPulsos < 23310){
				distanciaSR04 = cuentaPulsos * 34 / 2000;
			}else{
				distanciaSR04 = 400;
			}
			flancoEco_SR04 = 0;
		break;
		default:
			flancoEco_SR04 = 0;
		break;
	} //end switch flancoEco_SR04

	//sensores_dist = SI << 2 | SF << 1 | SD (logica negativa)
	SI = (HAL_GPIO_ReadPin(IN_sensorL_GPIO_Port, IN_sensorL_Pin)) ;
	SD = HAL_GPIO_ReadPin(IN_sensorR_GPIO_Port, IN_sensorR_Pin);
	if (distanciaSR04 < 25) SF = 0; else SF = 1;

	sensores_dist = SI << 2 | SF << 1 | SD;
} //end sensores()


void aceleracion (void){
	if (velL < velLFinal) velL++;

} //end aceleracion()

void movimientoLibre (void){

	if (avance_cant != 0) avance_cant = 0;
	if (retroceso_cant != 0) retroceso_cant = 0;
	if (giroIzq_cant != 0) giroIzq_cant = 0;
	if (giroDer_cant != 0) giroDer_cant = 0;

	switch (status_movimiento) {
		case QUIETO:

//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);

			velL = 0;
			velR = 0;
			//periodo_Encoder = 0;

			status_movimiento = AVANZANDO;
		break;
		case AVANZANDO:

//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 1);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 1);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);

			velL = 5;
			velR = 5;

			switch (sensores_dist) {
				case 0b110:
					//agregado para prueba
					//status_movimiento = PIVOTE_IZQ_AVAN;
					status_movimiento = ROTANDO_IZQ;

					encoderL_memPositivo += __HAL_TIM_GET_COUNTER(&htim3);
					__HAL_TIM_SET_COUNTER(&htim3, 0);

				break;
				case 0b101:
				case 0b100:
				case 0b000:
					status_movimiento = ROTANDO_IZQ;

					encoderL_memPositivo += __HAL_TIM_GET_COUNTER(&htim3);
					__HAL_TIM_SET_COUNTER(&htim3, 0);
				break;
				case 0b011:
					//agregado para prueba
					//status_movimiento = PIVOTE_DER_AVAN;
					status_movimiento = ROTANDO_DER;

					encoderR_memPositivo += __HAL_TIM_GET_COUNTER(&htim2);
					__HAL_TIM_SET_COUNTER(&htim2, 0);

				break;
				case 0b001:
					status_movimiento = ROTANDO_DER;

					encoderR_memPositivo += __HAL_TIM_GET_COUNTER(&htim2);
					__HAL_TIM_SET_COUNTER(&htim2, 0);

				break;
				default:
				break;
			} //end switch sensores_dist

		break;
		case ROTANDO_IZQ:

//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 1);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 1);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);

			velL = -5;
			velR = 5;

			switch (sensores_dist){
				case 0b111:
					status_movimiento = AVANZANDO;

					encoderL_memNegativo += __HAL_TIM_GET_COUNTER(&htim3);
					__HAL_TIM_SET_COUNTER(&htim3, 0);

					break;
				case 0b011:
					status_movimiento = ROTANDO_DER;

					encoderL_memNegativo += __HAL_TIM_GET_COUNTER(&htim3);
					__HAL_TIM_SET_COUNTER(&htim3, 0);
					encoderR_memPositivo += __HAL_TIM_GET_COUNTER(&htim2);
					__HAL_TIM_SET_COUNTER(&htim2, 0);

				default:
					break;
			} //end switch sensores_dist

		break;
		case ROTANDO_DER:
//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 1);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 1);

			velL = 5;
			velR = -5;

			switch (sensores_dist){
				case 0b111:
					status_movimiento = AVANZANDO;

					encoderR_memNegativo += __HAL_TIM_GET_COUNTER(&htim2);
					__HAL_TIM_SET_COUNTER(&htim2, 0);

					break;
				case 0b110:
					status_movimiento = ROTANDO_IZQ;

					encoderL_memPositivo += __HAL_TIM_GET_COUNTER(&htim3);
					__HAL_TIM_SET_COUNTER(&htim3, 0);
					encoderR_memNegativo += __HAL_TIM_GET_COUNTER(&htim2);
					__HAL_TIM_SET_COUNTER(&htim2, 0);

				default:
					break;
			} //end switch sensores_dist

		break;
		case RETROCEDIENDO:
//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 1);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 1);

			velL = -5;
			velR = -5;

			status_movimiento = AVANZANDO;
			break;
		case PIVOTE_IZQ_AVAN:
//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 1);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);

			velL = 0;
			velR = 5;

			switch (sensores_dist){
				case 0b111:
					status_movimiento = AVANZANDO;
				break;
				case 0b011:
					status_movimiento = ROTANDO_DER;
				break;
				case 0b100:
					status_movimiento = ROTANDO_IZQ;
				default:
				break;
			} //end switch sensores_dist

		break;
		case PIVOTE_DER_AVAN:
//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 1);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);

			velL = 5;
			velR = 0;

			switch (sensores_dist){
				case 0b111:
					status_movimiento = AVANZANDO;
				break;
				case 0b110:
					status_movimiento = ROTANDO_IZQ;
				break;
				case 0b001:
					status_movimiento = ROTANDO_DER;
				default:
				break;
			} //end switch sensores_dist

		default:
		break;

	} //fin switch status_movimiento

} //fin movimientoLibre()

void movimientoRC (void){

