Lucho431/Robotica/robot_core_STM32F429IGT6/Core/Src/main.c
	if (!avance_cant && !retroceso_cant && !giroIzq_cant && !giroDer_cant ){
		status_movimiento = QUIETO;
	}

	switch (status_movimiento) {
		case QUIETO:

//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);

			velL = 0;
			velR = 0;

			//periodo_muestrasOdometria = 0;

			if (avance_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = AVANZANDO;
				break;
			}

			if (retroceso_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = RETROCEDIENDO;
				break;
			}

			if (giroIzq_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = ROTANDO_IZQ;
				break;
			}

			if (giroDer_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = ROTANDO_DER;
				break;
			}

		break;
		case AVANZANDO:

//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 1);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 1);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);

			velL = 5;
			velR = 5;

			if (avance_cant > ((acum_encoderL + acum_encoderR) >> 1) ) break;

			avance_cant = 0;

			status_movimiento = QUIETO;

			if (retroceso_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = RETROCEDIENDO;
				break;
			}

			if (giroIzq_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = ROTANDO_IZQ;
				break;
			}

			if (giroDer_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = ROTANDO_DER;
				break;
			}

		break;
		case ROTANDO_IZQ:

//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 1);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 1);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);

			velL = -5;
			velR = 5;


			if (giroIzq_cant > ((acum_encoderL + acum_encoderR) >> 1) ) break;

			giroIzq_cant = 0;

			status_movimiento = QUIETO;

			if (avance_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = AVANZANDO;
				break;
			}

			if (retroceso_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = RETROCEDIENDO;
				break;
			}

			if (giroDer_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = ROTANDO_DER;
				break;
			}

		break;
		case ROTANDO_DER:
//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 1);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 1);

			velL = 5;
			velR = -5;

			if (giroDer_cant > ((acum_encoderL + acum_encoderR) >> 1) ) break;

			giroDer_cant = 0;

			status_movimiento = QUIETO;

			if (avance_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = AVANZANDO;
				break;
			}

			if (retroceso_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = RETROCEDIENDO;
				break;
			}

			if (giroIzq_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = ROTANDO_IZQ;
				break;
			}

		break;
		case RETROCEDIENDO:
//			HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
//			HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
//
//			HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 1);
//			HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 1);

			velL = -5;
			velR = -5;


			if (retroceso_cant > ((acum_encoderL + acum_encoderR) >> 1) ) break;

			retroceso_cant = 0;

			status_movimiento = QUIETO;

			if (avance_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = AVANZANDO;
				break;
			}

			if (giroIzq_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = ROTANDO_IZQ;
				break;
			}

			if (giroDer_cant != 0){
				acum_encoderL = 0;
				acum_encoderR = 0;
				status_movimiento = ROTANDO_DER;
				break;
			}

		break;
		case PIVOTE_IZQ_AVAN:

		break;
		case PIVOTE_DER_AVAN:

		default:
		break;

	} //fin switch status_movimiento

} //fin movimientoRC()

void calibraMag (void){

	//checkeo del estatud de calibración
	switch (estatus_calibraMag) {
		case 0:
			magX_min = 1000; magX_max = -1000;
			magY_min = 1000; magY_max = -1000;
			magX_media = 1; magY_media = 1;
			magX_range = 1; magY_range = 1;
			acum_encoderL = 0;
			acum_encoderR = 0;
			velL = -4;
			velR = +4;
			giroIzq_cant = 170;
			estatus_calibraMag = 1;
		break;
		case 1:
			if (giroIzq_cant < ((acum_encoderL + acum_encoderR) >> 1) ){
				velL = 0;
				velR = 0;
				giroIzq_cant = 0;
				estatus_calibraMag = 2;
				periodo_calibraMag = 200;
			}

			if (raw_magX < magX_min) magX_min = raw_magX;
			if (raw_magX > magX_max) magX_max = raw_magX;
			if (raw_magY < magY_min) magY_min = raw_magY;
			if (raw_magY > magY_max) magY_max = raw_magY;
			magX_media = (magX_min + magX_max) / 2.0;
			magY_media = (magY_min + magY_max) / 2.0;
			magX_range = (magX_max - magX_min) / 1.0;
			magY_range = (magY_max - magY_min) / 1.0;
		break;
		case 2:
			if (!periodo_calibraMag){
				estatus_calibraMag = 3;
			}
		break;
		case 3:
			if (direccion_i16 > 17){
				velL = +4;
				velR = -4;
			}else if (direccion_i16 < -17){
				velL = -4;
				velR = +4;
			}else{
				velL = 0;
				velR = 0;
				estatus_calibraMag = 4;
			}

		break;
		case 4:
			direccionGiro_rad_f32 = direccionMag_rad_f32;
			modoFuncionamiento = MANUAL;
			estatus_calibraMag = 0;
			sprintf((char*)txUart, "modMAN");
			send_info(txUart);
		break;
		default:
		break;
	} //fin switch estatus_calibraMag

} //fin calibraMag ()


