Lucho431/Robotica/robot_core_STM32F429IGT6/Core/Src/main.c
void mov_puntoAPunto (void){

	if (!flag_dest) estatusPuntoAPunto = 0;

	switch (estatusPuntoAPunto) {
		case 0: //espera destino
			if(flag_dest != 0){
				estatusPuntoAPunto = 1;
				sprintf((char*)txUart, "girand");
				send_info(txUart);
			}
		break;
		case 1: //gira al destino
			deltaX_dest = posX_dest - posX_f32; //posX_i16 cuando era entero;
			deltaY_dest = posY_dest - posY_f32; //posY_i16 cuando era entero;
			anguloDest_rad_f32 = atan2f(deltaY_dest, deltaX_dest);
			anguloDest_grad_f32 = anguloDest_rad_f32 * 180.0 / M_PI; //grados en float
			anguloDest_grad_i32 = anguloDest_grad_f32 * 1000; //milesimas de grados en int32

			deltaAng_dest = anguloDest_grad_i32 - direccion_i16 * 1000;
			if (deltaAng_dest > 180000) deltaAng_dest -= 360000;
			if (deltaAng_dest < -180000) deltaAng_dest += 360000;

			if (deltaAng_dest > 17000){
				velL = -4;
				velR = +4;
				ticks_PuntoAPunto = 20;
			}else if (deltaAng_dest < -17000){
				velL = +4;
				velR = -4;
				ticks_PuntoAPunto = 20;
			}else{
				velL = 0;
				velR = 0;
				if (!ticks_PuntoAPunto){
					estatusPuntoAPunto = 2;
					sprintf((char*)txUart, "avanza");
					send_info(txUart);
				}
			}

		break;
		case 2: //avanza al destino
			deltaX_dest = posX_dest - posX_f32; //posX_i16 cuando era entero;
			deltaY_dest = posY_dest - posY_f32; //posY_i16 cuando era entero;

			if (  abs(deltaX_dest) < 1.0 && abs(deltaY_dest) < 1.0){
				estatusPuntoAPunto = 3;
				velL = 0;
				velR = 0;
				sprintf((char*)txUart, "orient");
				send_info(txUart);
				break;
			}

			anguloDest_rad_f32 = atan2f(deltaY_dest, deltaX_dest);
			anguloDest_grad_f32 = anguloDest_rad_f32 * 180.0 / M_PI; //grados en float
			anguloDest_grad_i32 = anguloDest_grad_f32 * 1000; //milesimas de grados en int32
			deltaAng_dest = anguloDest_grad_i32 - direccion_i16 * 1000;
			if (deltaAng_dest > 180000) deltaAng_dest -= 360000;
			if (deltaAng_dest < -180000) deltaAng_dest += 360000;

			if (deltaAng_dest > 17000){
				if (deltaAng_dest > 45000){
					velL = -4;
					velR = +4;
				}else{
					velL = +4;
					velR = +5;
				}
			}else if (deltaAng_dest < -17000){
				if (deltaAng_dest < -45000){
					velL = +4;
					velR = -4;
				}else{
					velL = +5;
					velR = +4;
				}
			}else{
				velL = +5;
				velR = +4;
			}


		break;
		case 3: // orienta en la coordenada angulo del destino
			deltaAng_dest = (direccion_dest - direccion_i16) * 1000;
			if (deltaAng_dest > 180000) deltaAng_dest -= 360000;
			if (deltaAng_dest < -180000) deltaAng_dest += 360000;

			if (deltaAng_dest > 17000){
				velL = -4;
				velR = +4;
			}else if (deltaAng_dest < -17000){
				velL = +4;
				velR = -4;
			}else{
				velL = 0;
				velR = 0;
				estatusPuntoAPunto = 4;
			}
		break;
		case 4: // finaliza la secuencia
			flag_dest = 0;
			estatusPuntoAPunto = 0;
			sprintf((char*)txUart, "ENDEST");
			send_info(txUart);

		break;
	}

} //fin mov_puntoAPunto ()






void velocidades (int8_t vl, int8_t vr){


	if (flag_quieto != 0){
		HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
		HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
		HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
		HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);
		return;
	}

	if (vl < 0){
		HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
		HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 1);
	} else if (vl > 0){
		HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 1);
		HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
	} else {
		HAL_GPIO_WritePin(OUT_in1_GPIO_Port, OUT_in1_Pin, 0);
		HAL_GPIO_WritePin(OUT_in2_GPIO_Port, OUT_in2_Pin, 0);
	}

	if (vr < 0){
		HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
		HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 1);
	} else if (vr > 0){
		HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 1);
		HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);
	} else {
		HAL_GPIO_WritePin(OUT_in4_GPIO_Port, OUT_in4_Pin, 0);
		HAL_GPIO_WritePin(OUT_in3_GPIO_Port, OUT_in3_Pin, 0);
	}

	velLFinal = abs(vl);
	velRFinal = abs(vr);

} //end velocidades()

void encoders_PWM (void){

	encoderL = __HAL_TIM_GET_COUNTER(&htim3);
	__HAL_TIM_SET_COUNTER(&htim3, 0);
	encoderR = __HAL_TIM_GET_COUNTER(&htim2);
	__HAL_TIM_SET_COUNTER(&htim2, 0);

	encoderL_delta = encoderL + encoderL_memPositivo + encoderL_memNegativo;
	encoderR_delta = encoderR + encoderR_memPositivo + encoderR_memNegativo;

	TIM4->CCR1 += velLFinal - encoderL_delta;
//	if (TIM4->CCR1 < 62) TIM4->CCR1 = 62;
//	if (TIM4->CCR1 > 82) TIM4->CCR1 = 82;

	TIM4->CCR2 += velRFinal - encoderR_delta;
//	if (TIM4->CCR2 < 62) TIM4->CCR2 = 62;
//	if (TIM4->CCR2 > 82) TIM4->CCR2 = 82;

	//avance del centro de masa
	if (velL > 0)
		distL = encoderL + encoderL_memPositivo - encoderL_memNegativo;
	else
		distL = -encoderL + encoderL_memPositivo - encoderL_memNegativo;

	if (velR > 0)
		distR = encoderR + encoderR_memPositivo - encoderR_memNegativo;
	else
		distR = -encoderR + encoderR_memPositivo - encoderR_memNegativo;

	distC = (distL + distR) >> 1;

	//acumula encoders
//	acum_encoderL += encoderL + encoderL_memPositivo - encoderL_memNegativo;
//	acum_encoderR += encoderR + encoderR_memPositivo - encoderR_memNegativo;
	acum_encoderL += encoderL_delta;
	acum_encoderR += encoderR_delta;

	encoderL_memNegativo = 0;
	encoderL_memPositivo = 0;
	encoderR_memNegativo = 0;
	encoderR_memPositivo = 0;

} //fin encoders_PWM()


void lecturaMPU9265 (void){
	//magnetometro
	mpu9265_Read_Magnet(&mpu9265);
	raw_magX = (float) (mpu9265.Magnet_X_RAW); //media empirica +359.0
	raw_magY = (float) (mpu9265.Magnet_Y_RAW); //media empirica -159.0

	magX_iirX0 = raw_magX - magX_media;
	magY_iirX0 = raw_magY - magY_media;
	if (magX_range != 0.0) magX_iirX0 /= magX_range;
	if (magY_range != 0.0) magY_iirX0 /= magY_range;

	if (!flag_iniciaIIR){
		magX = magX_iirY1 + betaIIR * (magX_iirX0 - magX_iirY1);
		magY = magY_iirY1 + betaIIR * (magY_iirX0 - magY_iirY1);

	}else{
		magX = magX_iirX0;
		magY = magY_iirX0;
		//flag_iniciaIIR = 0; //comentado -> sin filtro
	}
	//giroscopio
	mpu9265_Read_Gyro(&mpu9265);
	gyroZ = (float) (mpu9265.Gyro_Z_RAW / 131.0);
} //fin lecturaIMU()


