Lucho431/Robotica/robot_core_STM32F429IGT6/Core/Src/main.c
void posicionamiento (void){
	//actualizo el angulo anterior
	last_direccion_f32 = direccion_f32;

	//calculo de angulo por magnetometro

//	sum_magX = 0;
//	sum_magY = 0;
//	for (uint8_t i = 0; i < 32; i++){
//		mpu9265_Read_Magnet(&mpu9265);
//		sum_magX += mpu9265.Magnet_X_RAW;
//		sum_magY += mpu9265.Magnet_Y_RAW;
//	} //fin for i
//	magX = (float) (sum_magX >> 5);
//	magY = (float) (sum_magY >> 5);
//
//	mpu9265_Read_Magnet(&mpu9265);
//	magX = (float) (mpu9265.Magnet_X_RAW); //media empirica +359.0
//	magY = (float) (mpu9265.Magnet_Y_RAW); //media empirica -159.0
//
//	if (magX < magX_min) magX_min = magX;
//	if (magX > magX_max) magX_max = magX;
//	if (magY < magY_min) magY_min = magY;
//	if (magY > magY_max) magY_max = magY;
//	magX_media = (magX_min + magX_max) / 2.0;
//	magY_media = (magY_min + magY_max) / 2.0;
//	magX_range = (magX_max - magX_min) / 1.0;
//	magY_range = (magY_max - magY_min) / 1.0;
//	magX -= magX_media;
//	magY -= magY_media;
//	if (magX_range != 0.0) magX /= magX_range;
//	if (magY_range != 0.0) magY /= magY_range;

	direccionMag_rad_f32 = atan2f(magY, magX); //radianes en float
	direccionMag_grad_f32 = direccionMag_rad_f32 * 180.0 / M_PI; //grados en float

	if (direccionMag_grad_f32 > 90.0){
		if (last_direccion_f32 < 0.0){
			last_direccion_f32 += 360.0;
		}
	}else if (direccionMag_grad_f32 < -90.0){
		if (last_direccion_f32 > 0.0){
			last_direccion_f32 -= 360.0;
		}
	} //fin if direccionMag_grad_f32...

	//calculo de angulo por giroscopio
	direccionGiro_grad_f32 += gyroZ * 0.21; //grados en float

	if (direccionGiro_grad_f32 < -180.0){
		direccionGiro_grad_f32 += 360.0;
	}
	if (direccionGiro_grad_f32 > 180.0){
		direccionGiro_grad_f32 -= 360.0;
	}

	//filtro complementario magnetometro y giroscopio
//	direccion_f32 = direccionMag_grad_f32 * alfa_filtroCompl + (last_direccion_f32 + gyroZ * 0.21) * (1 - alfa_filtroCompl);

	//sin el filtro, solo mag
	direccion_f32 = direccionMag_grad_f32;

	//coordenadas de posicionamiento
	direccion_rad = direccion_f32 * M_PI / 180.0; //radianes en float
	direccion_i16 = direccion_f32; //grados en int16
	posX_f32 += (float) (distC * 0.07855 * cosf(direccion_rad)); //posicion X en float
	posY_f32 += (float) (distC * 0.07855 * sinf(direccion_rad)); //posicion Y en float
	distC = 0;
	posX_i16 = posX_f32; //posicion X en int16
	posY_i16 = posY_f32; //posicion Y en int16

//	posX_f32 += (float) (distC * cosf(direccionGiro_rad_f32)); //posicion X en float
//	posY_f32 += (float) (distC * sinf(direccionGiro_rad_f32)); //posicion Y en float
//	distC = 0;
//	direccionGiro_grad_i16 = direccionGiro_grad_f32; //grados en int16
//	posX_i16 = posX_f32; //posicion X en int16
//	posY_i16 = posY_f32; //posicion Y en int16

} //fin posicionamiento ()

void OLD_posicionamiento (void){

	//saco el angulo...


	//por magnetometro
	mpu9265_Read_Magnet(&mpu9265);
	magX = (float) (mpu9265.Magnet_X_RAW); //media empirica +359.0
	magY = (float) (mpu9265.Magnet_Y_RAW); //media empirica -159.0

	if (magX < magX_min) magX_min = magX;
	if (magX > magX_max) magX_max = magX;
	if (magY < magY_min) magY_min = magY;
	if (magY > magY_max) magY_max = magY;
	magX_media = (magX_min + magX_max) / 2.0;
	magY_media = (magY_min + magY_max) / 2.0;

	magX -= magX_media;
	magY -= magY_media;
	magX /= magX_media;
	magY /= magY_media;

	direccionMag_rad_f32 = atan2f(magY, magX); //radianes en float

	posX_f32 += (float) (distC * 0.1 * cosf(direccionMag_rad_f32)); //posicion X en float
	posY_f32 += (float) (distC * 0.1 * sinf(direccionMag_rad_f32)); //posicion Y en float
	distC = 0;
	direccionMag_grad_f32 = direccionMag_rad_f32 * 180.0 / M_PI; //grados en float
	direccionMag_grad_i16 = direccionMag_grad_f32; //grados en int16
	direccion_i16 = direccionMag_grad_i16;
	posX_i16 = posX_f32; //posicion X en int16
	posY_i16 = posY_f32; //posicion Y en int16
/*
	//por giroscopio
	mpu9265_Read_Gyro(&mpu9265);
	gyroZ = (float) (mpu9265.Gyro_Z_RAW / 131.0);
	modGyroZ = abs(gyroZ * 0.21);
	if (modGyroZ > 0.5){
		direccionGiro_grad_f32 += gyroZ * 0.21; //grados en float
	}
	if (direccionGiro_grad_f32 < 0){
		direccionGiro_grad_f32 += 360.0;
	}
	if (direccionGiro_grad_f32 > 360.0){
		direccionGiro_grad_f32 -= 360.0;
	}
	direccionGiro_rad_f32 = (direccionGiro_grad_f32 * M_PI / 180.0); //radianes en float

//	posX_f32 += (float) (distC * cosf(direccionGiro_rad_f32)); //posicion X en float
//	posY_f32 += (float) (distC * sinf(direccionGiro_rad_f32)); //posicion Y en float
//	distC = 0;
//	direccionGiro_grad_i16 = direccionGiro_grad_f32; //grados en int16
//	posX_i16 = posX_f32; //posicion X en int16
//	posY_i16 = posY_f32; //posicion Y en int16
*/
	/*
	//filtro complementario magnetometro y giroscopio
	direccion_rad = coef_gyro * direccionGiro_rad_f32 + coef_mag * direccionMag_rad_f32;

	//coordenadas
	direccion_grad = direccion_rad * 180.0 / M_PI; //grados en float
	direccion_i16 = direccion_grad; //grados en int16
	posX_f32 += (float) (distC * 0.1 * cosf(direccion_rad)); //posicion X en float
	posY_f32 += (float) (distC * 0.1 * sinf(direccion_rad)); //posicion Y en float
	posX_i16 = posX_f32; //posicion X en int16
	posY_i16 = posY_f32; //posicion Y en int16
	*/

/*
	//por odometria
	direccion_rad += (float) ( (distR - distL) * RADIANES_X_PULSO); //radianes en float

	if (direccion_rad < 0){
		direccion_rad += M_TWOPI;
	}
	if (direccion_rad > M_TWOPI){
		direccion_rad -= M_TWOPI;
	}

	posX_f32 += (float) (distC * cosf(direccion_rad)); //posicion X en float
	posY_f32 += (float) (distC * sinf(direccion_rad)); //posicion Y en float
	distC = 0;
	direccion_f32 = direccion_rad * (180.0/M_PI); //grados en float
	direccion_i16 = direccion_f32; //grados en int16
	posX_i16 = posX_f32; //posicion X en int16
	posY_i16 = posY_f32; //posicion Y en int16
*/

} //fin OLD_posicionamiento ()


void test_respuesta (void){
	switch(rxUart[0]){
		case AVANCE:
//			sprintf((char *)txUart, "avan");
		break;
		case RETROCEDE:
//			sprintf((char *)txUart, "RETR");
		break;
		case GIRO_IZQ:
//			sprintf((char *)txUart, "IZQU");
		break;
		case GIRO_DER:
//			sprintf((char *)txUart, "DERE");
		break;
	} //end switch rxUart

	HAL_UART_Transmit(&huart7, txUart, 4, 20);
	HAL_UART_Receive_IT(&huart7, rxUart, 4);
} //fin test_prueba ()


void modo_funcionamiento (void){

	switch (modoFuncionamiento) {
		case AUTOMATICO:
			movimientoLibre();
		break;
		case MANUAL:
			movimientoRC();
		break;
		case CALIBRA_MAG:
			calibraMag();
		break;
		case PUNTO_A_PUNTO:
			mov_puntoAPunto();
		default:
		break;
	} //end switch modoFuncionamiento

} //end modo_funcionamiento ()

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
